# DimensionEqualityLabelFormatting Properties

---
The DimensionEqualityLabelFormatting type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LabelType|  The parameter value to be shown.
| LeadingSpaces|  The number of spaces to include before the parameter value.
| Prefix|  The prefix to include before the parameter value.
| Suffix|  The suffix to include after the parameter value.
Top
#### Reference
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace